optimization/0.orig/Ua
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ua;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            adjointInletVelocity;
        value           $internalField;
    }

    outlet
    {
        type            adjointOutletVelocity;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    lowerWall
    {
        type            adjointFarFieldVelocity;
        value           $internalField;
    }

    keel
    {
        type            adjointWallVelocity;
        value           $internalField;
    }

    hull
    {
        type            adjointWallVelocity;
        value           $internalField;
    }

    upperWall
    {
        type            adjointFarFieldVelocity;
        value           $internalField;
    }

    frontAndBack
    {
        type            adjointFarFieldVelocity;
        value           $internalField;
    }

}


// ************************************************************************* //
