optimization/0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.5e-04;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    lowerWall
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    frontAndBack
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    inlet
    {
	type  fixedValue;
	value $internalField;
    }

    upperWall
    {
        type            fixedValue;
        value           uniform 0;
    }

    hull
    {
        type            fixedValue;
        value           uniform 0;
    }

    keel
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
